sulaolab/sonora-ak-nano/src/boot/hal_gpio/nora_pps_dspic33ak.c
    switch (rp)
    {
#ifdef _RP129R
    case 129u:
#endif
#ifdef _RP130R
    case 130u:
#endif
#ifdef _RP131R
    case 131u:
#endif
#ifdef _RP132R
    case 132u:
#endif
#ifdef _RP133R
    case 133u:
#endif
#ifdef _RP134R
    case 134u:
#endif
#ifdef _RP135R
    case 135u:
#endif
#ifdef _RP136R
    case 136u:
#endif
#ifdef _RP137R
    case 137u:
#endif
#ifdef _RP138R
    case 138u:
#endif
#ifdef _RP139R
    case 139u:
#endif
#ifdef _RP140R
    case 140u:
#endif
#ifdef _RP141R
    case 141u:
#endif
#ifdef _RP142R
    case 142u:
#endif
#ifdef _RP143R
    case 143u:
#endif
#ifdef _RP144R
    case 144u:
#endif
        return true;
    default:
        break;
    }
    return false;
#endif
}


//===========================================================
// Local: read the output function code from a physical RP pin's _RPnnR
//===========================================================
// dsPIC33AK RPORx registers pack four RP output codes into 8-bit slots, with
// RP1 in the low slot of RPOR0. Callers first validate the RP against the
// _RPnnR switch below, so this only reads a physical output PPS register.
static uint8_t nora_pps_read_output_rp(nora_gpio_rp_t rp)
{
    volatile uint32_t *reg = (&RPOR0) + ((rp - 1u) / 4u);
    const uint32_t pos = ((rp - 1u) % 4u) * 8u;

    return (uint8_t)((*reg >> pos) & 0x7Fu);
}


//===========================================================
// Local: is rp a physical remappable pin on this device?
//===========================================================
// PPS input sources and output pins are the same physical RP set, so an RP that
// the device defines an output register (_RPnnR) for is a valid physical RP.
// Used to validate the RP handed to route_input(); route_output()'s write switch
// validates inherently. RPV virtual pins (RP129..) have no _RPnnR and are rejected.
static bool nora_pps_rp_is_defined(nora_gpio_rp_t rp)
{
    switch (rp)
    {
#if SONORA_RESIDENT_BOOTLOADER_AK128
#ifdef _RP50R
    case 50u:
#endif
#ifdef _RP52R
    case 52u:
#endif
#else
#ifdef _RP1R
    case 1u:
#endif
#ifdef _RP2R
    case 2u:
#endif
#ifdef _RP3R
    case 3u:
#endif
#ifdef _RP4R
    case 4u:
#endif
#ifdef _RP5R
    case 5u:
#endif
#ifdef _RP6R
    case 6u:
#endif
#ifdef _RP7R
    case 7u:
#endif
#ifdef _RP8R
    case 8u:
#endif
#ifdef _RP9R
    case 9u:
#endif
#ifdef _RP10R
    case 10u:
#endif
#ifdef _RP11R
    case 11u:
#endif
#ifdef _RP12R
    case 12u:
#endif
#ifdef _RP13R
    case 13u:
#endif
#ifdef _RP14R
    case 14u:
#endif
#ifdef _RP15R
    case 15u:
#endif
#ifdef _RP16R
    case 16u:
#endif
#ifdef _RP17R
    case 17u:
#endif
#ifdef _RP18R
    case 18u:
#endif
#ifdef _RP19R
    case 19u:
#endif
#ifdef _RP20R
    case 20u:
#endif
#ifdef _RP21R
    case 21u:
#endif
#ifdef _RP22R
    case 22u:
#endif
#ifdef _RP23R
    case 23u:
#endif
#ifdef _RP24R
    case 24u:
#endif
#ifdef _RP25R
    case 25u:
#endif
#ifdef _RP26R
    case 26u:
#endif
#ifdef _RP27R
    case 27u:
#endif
#ifdef _RP28R
    case 28u:
#endif
#ifdef _RP29R
    case 29u:
#endif
#ifdef _RP30R
    case 30u:
#endif
#ifdef _RP31R
    case 31u:
#endif
#ifdef _RP32R
    case 32u:
#endif
#ifdef _RP33R
    case 33u:
#endif
#ifdef _RP34R
    case 34u:
#endif
#ifdef _RP35R
    case 35u:
#endif
#ifdef _RP36R
    case 36u:
#endif
#ifdef _RP37R
    case 37u:
#endif
#ifdef _RP38R
    case 38u:
#endif
#ifdef _RP39R
    case 39u:
#endif
#ifdef _RP40R
    case 40u:
#endif
#ifdef _RP41R
    case 41u:
#endif
#ifdef _RP42R
    case 42u:
#endif
#ifdef _RP43R
    case 43u:
#endif
#ifdef _RP44R
    case 44u:
#endif
#ifdef _RP45R
    case 45u:
#endif
#ifdef _RP46R
    case 46u:
#endif
#ifdef _RP47R
    case 47u:
#endif
#ifdef _RP48R
    case 48u:
#endif
#ifdef _RP49R
    case 49u:
#endif
#ifdef _RP50R
    case 50u:
#endif
#ifdef _RP51R
    case 51u:
#endif
#ifdef _RP52R
    case 52u:
#endif
#ifdef _RP53R
    case 53u:
#endif
#ifdef _RP54R
    case 54u:
#endif
#ifdef _RP55R
    case 55u:
#endif
#ifdef _RP56R
    case 56u:
#endif
#ifdef _RP57R
    case 57u:
#endif
#ifdef _RP58R
    case 58u:
#endif
#ifdef _RP59R
    case 59u:
#endif
#ifdef _RP60R
    case 60u:
#endif
#ifdef _RP61R
    case 61u:
#endif
#ifdef _RP62R
    case 62u:
#endif
#ifdef _RP63R
    case 63u:
#endif
#ifdef _RP64R
    case 64u:
#endif
#ifdef _RP65R
    case 65u:
#endif
#ifdef _RP66R
    case 66u:
#endif
#ifdef _RP67R
    case 67u:
#endif
#ifdef _RP68R
    case 68u:
#endif
#ifdef _RP69R
    case 69u:
#endif
#ifdef _RP70R
    case 70u:
#endif
#ifdef _RP71R
    case 71u:
#endif
#ifdef _RP72R
    case 72u:
#endif
#ifdef _RP73R
    case 73u:
#endif
#ifdef _RP74R
    case 74u:
#endif
#ifdef _RP75R
    case 75u:
#endif
#ifdef _RP76R
    case 76u:
#endif
#ifdef _RP77R
    case 77u:
#endif
#ifdef _RP78R
    case 78u:
#endif
#ifdef _RP79R
    case 79u:
#endif
#ifdef _RP80R
    case 80u:
#endif
#ifdef _RP81R
    case 81u:
#endif
#ifdef _RP82R
    case 82u:
#endif
#ifdef _RP83R
    case 83u:
#endif
#ifdef _RP84R
    case 84u:
#endif
#ifdef _RP85R
    case 85u:
#endif
#ifdef _RP86R
    case 86u:
#endif
#ifdef _RP87R
    case 87u:
#endif
#ifdef _RP88R
    case 88u:
#endif
#ifdef _RP89R
    case 89u:
#endif
#ifdef _RP90R
    case 90u:
#endif
#ifdef _RP91R
    case 91u:
#endif
#ifdef _RP92R
    case 92u:
#endif
#ifdef _RP93R
    case 93u:
#endif
#ifdef _RP94R
    case 94u:
#endif
#ifdef _RP95R
    case 95u:
#endif
#ifdef _RP96R
    case 96u:
#endif
#ifdef _RP97R
    case 97u:
#endif
#ifdef _RP98R
    case 98u:
#endif
#ifdef _RP99R
    case 99u:
#endif
#ifdef _RP100R
    case 100u:
#endif
#ifdef _RP101R
    case 101u:
#endif
#ifdef _RP102R
    case 102u:
#endif
#ifdef _RP103R
    case 103u:
#endif
#ifdef _RP104R
    case 104u:
#endif
#ifdef _RP105R
    case 105u:
#endif
#ifdef _RP106R
    case 106u:
#endif
#ifdef _RP107R
    case 107u:
#endif
#ifdef _RP108R
    case 108u:
#endif
#ifdef _RP109R
    case 109u:
#endif
#ifdef _RP110R
    case 110u:
#endif
#ifdef _RP111R
    case 111u:
#endif
#ifdef _RP112R
    case 112u:
#endif
#ifdef _RP113R
    case 113u:
#endif
#ifdef _RP114R
    case 114u:
#endif
#ifdef _RP115R
    case 115u:
#endif
#ifdef _RP116R
    case 116u:
#endif
#ifdef _RP117R
    case 117u:
#endif
#ifdef _RP118R
    case 118u:
#endif
#ifdef _RP119R
    case 119u:
#endif
#ifdef _RP120R
    case 120u:
#endif
#ifdef _RP121R
    case 121u:
#endif
#ifdef _RP122R
    case 122u:
#endif
#ifdef _RP123R
    case 123u:
#endif
#ifdef _RP124R
    case 124u:
#endif
#ifdef _RP125R
    case 125u:
#endif
#ifdef _RP126R
    case 126u:
#endif
#ifdef _RP127R
    case 127u:
#endif
#ifdef _RP128R
    case 128u:
#endif
#endif
        return true;
    default:
        return false;
    }
}


//===========================================================
// Global
//===========================================================
bool nora_pps_route_output(nora_pps_output_t output, nora_gpio_rp_t rp)
{
    uint8_t code;
    if (!nora_pps_get_output_code(output, &code))
    {
        return false;
    }

    nora_pps_unlock();
    bool ok = nora_pps_write_output_rp(rp, code);
    nora_pps_lock();
    return ok;
}

