sulaolab/sonora-ak-nano/src/boot/hal_gpio/nora_pps_dspic33ak.c
bool nora_pps_find_output_rp(nora_pps_output_t output, nora_gpio_rp_t *rp)
{
    uint8_t want;

    if (rp == NULL)
    {
        return false;
    }
    if (!nora_pps_get_output_code(output, &want))
    {
        return false;   /* peripheral output not available on this device */
    }

    /* PHYSICAL pins only, and deliberately so even though route_output() now accepts
     * the virtual band: a caller asking "which pad is this signal on" does not want
     * RPV0, and a caller that put the signal on a virtual endpoint did so itself and
     * therefore already knows. Same rule as the CK backend.
     * nora_pps_rp_is_defined() also skips any RP number without an output PPS
     * register on the selected device. */
    for (nora_gpio_rp_t candidate = 1u; candidate <= 128u; ++candidate)
    {
        if (nora_pps_rp_is_defined(candidate) &&
            (nora_pps_read_output_rp(candidate) == want))
        {
            *rp = candidate;
            return true;
        }
    }

    return false;   /* no physical pin currently carries this output */
}

bool nora_pps_route_input(nora_pps_input_t input, nora_gpio_rp_t rp)
{
    bool ok = true;

    /* Reject any RP that is neither a physical remappable pin nor a virtual one
     * before writing. RPINRx input-selects take the RP NUMBER, and the virtual
     * numbers are legal values there -- that is how a padless output reaches
     * another peripheral's input -- so the check admits both bands and nothing
     * between or beyond them. */
    if (!nora_pps_rp_is_defined(rp) && !nora_pps_rpv_is_defined(rp))
    {
        return false;   /* rp is not a remappable pin, physical or virtual, here */
    }

    nora_pps_unlock();
    switch (input)
    {
#if SONORA_RESIDENT_BOOTLOADER_AK128
#ifdef _U1RXR
    case NORA_PPS_INPUT_U1RX: _U1RXR = rp; break;
#endif
#else
#ifdef _U1RXR
    case NORA_PPS_INPUT_U1RX: _U1RXR = rp; break;
#endif
#ifdef _U2RXR
    case NORA_PPS_INPUT_U2RX: _U2RXR = rp; break;
#endif
#ifdef _SS1R
    case NORA_PPS_INPUT_SS1:  _SS1R  = rp; break;
#endif
#ifdef _SCK1R
    case NORA_PPS_INPUT_SCK1: _SCK1R = rp; break;
#endif
#ifdef _SDI1R
    case NORA_PPS_INPUT_SDI1: _SDI1R = rp; break;
#endif
#ifdef _SS2R
    case NORA_PPS_INPUT_SS2:  _SS2R  = rp; break;
#endif
#ifdef _SCK2R
    case NORA_PPS_INPUT_SCK2: _SCK2R = rp; break;
#endif
#ifdef _SDI2R
    case NORA_PPS_INPUT_SDI2: _SDI2R = rp; break;
#endif
#ifdef _SS3R
    case NORA_PPS_INPUT_SS3:  _SS3R  = rp; break;
#endif
#ifdef _SCK3R
    case NORA_PPS_INPUT_SCK3: _SCK3R = rp; break;
#endif
#ifdef _SDI3R
    case NORA_PPS_INPUT_SDI3: _SDI3R = rp; break;
#endif
#ifdef _SS4R
    case NORA_PPS_INPUT_SS4:  _SS4R  = rp; break;
#endif
#ifdef _SCK4R
    case NORA_PPS_INPUT_SCK4: _SCK4R = rp; break;
#endif
#ifdef _SDI4R
    case NORA_PPS_INPUT_SDI4: _SDI4R = rp; break;
#endif
#ifdef _CLCINAR
    case NORA_PPS_INPUT_CLCINA: _CLCINAR = rp; break;
#endif
#ifdef _CLCINBR
    case NORA_PPS_INPUT_CLCINB: _CLCINBR = rp; break;
#endif
#ifdef _CLCINCR
    case NORA_PPS_INPUT_CLCINC: _CLCINCR = rp; break;
#endif
#ifdef _REFI1R
    case NORA_PPS_INPUT_REFI1: _REFI1R = rp; break;
#endif
#ifdef _CAN1RXR
    case NORA_PPS_INPUT_CAN1RX: _CAN1RXR = rp; break;
#endif
#ifdef _ICM1R
    case NORA_PPS_INPUT_ICM1: _ICM1R = rp; break;
#endif
#ifdef _ICM2R
    case NORA_PPS_INPUT_ICM2: _ICM2R = rp; break;
#endif
#ifdef _ICM3R
    case NORA_PPS_INPUT_ICM3: _ICM3R = rp; break;
#endif
#ifdef _ICM4R
    case NORA_PPS_INPUT_ICM4: _ICM4R = rp; break;
#endif
#ifdef _ICM5R
    case NORA_PPS_INPUT_ICM5: _ICM5R = rp; break;
#endif
#ifdef _ICM6R
    case NORA_PPS_INPUT_ICM6: _ICM6R = rp; break;
#endif
#ifdef _ICM7R
    case NORA_PPS_INPUT_ICM7: _ICM7R = rp; break;
#endif
#ifdef _ICM8R
    case NORA_PPS_INPUT_ICM8: _ICM8R = rp; break;
#endif
#ifdef _ICM9R
    case NORA_PPS_INPUT_ICM9: _ICM9R = rp; break;
#endif
#ifdef _U3RXR
    case NORA_PPS_INPUT_U3RX: _U3RXR = rp; break;
#endif
#ifdef _CLCINDR
    case NORA_PPS_INPUT_CLCIND: _CLCINDR = rp; break;
#endif
#ifdef _CLCINER
    case NORA_PPS_INPUT_CLCINE: _CLCINER = rp; break;
#endif
#ifdef _CLCINFR
    case NORA_PPS_INPUT_CLCINF: _CLCINFR = rp; break;
#endif
#ifdef _CLCINGR
    case NORA_PPS_INPUT_CLCING: _CLCINGR = rp; break;
#endif
#ifdef _CLCINHR
    case NORA_PPS_INPUT_CLCINH: _CLCINHR = rp; break;
#endif
#ifdef _CLCINIR
    case NORA_PPS_INPUT_CLCINI: _CLCINIR = rp; break;
#endif
#ifdef _CLCINJR
    case NORA_PPS_INPUT_CLCINJ: _CLCINJR = rp; break;
#endif
#ifdef _REFI2R
    case NORA_PPS_INPUT_REFI2: _REFI2R = rp; break;
#endif
#ifdef _CAN2RXR
    case NORA_PPS_INPUT_CAN2RX: _CAN2RXR = rp; break;
#endif
    /* External interrupts. INT1..INT3 exist on both families; _INT4R is AK-only. */
#ifdef _INT1R
    case NORA_PPS_INPUT_INT1: _INT1R = rp; break;
#endif
#ifdef _INT2R
    case NORA_PPS_INPUT_INT2: _INT2R = rp; break;
#endif
#ifdef _INT3R
    case NORA_PPS_INPUT_INT3: _INT3R = rp; break;
#endif
#ifdef _INT4R
    case NORA_PPS_INPUT_INT4: _INT4R = rp; break;
#endif
#endif
    default:
        ok = false;   /* peripheral input not available on this device */
        break;
    }
    nora_pps_lock();
    return ok;
}


/*
 * Combined pinmux helpers: digital-configure the pin, then route the PPS signal. See the header
 * for the contract. These reuse the low-level GPIO and PPS APIs as-is (no register duplication);
 * the GPIO configuration runs first so the glitch-aware order is preserved for outputs.
 */
bool nora_pinmux_route_input(nora_pps_input_t function, nora_gpio_rp_t rp)
{
    if (!nora_gpio_rp_config_digital_input(rp))
    {
        return false;
    }
    return nora_pps_route_input(function, rp);
}

bool nora_pinmux_route_output(nora_pps_output_t function, nora_gpio_rp_t rp,
                                   bool initial_high)
{
    if (!nora_gpio_rp_config_digital_output(rp, initial_high))
    {
        return false;
    }
    return nora_pps_route_output(function, rp);
}
